# -*- coding: utf-8 -*-
"""Копия блокнота "Python_Задачник_Кузьмина.А.1.ipynb"

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1iK38ilt8mBLE6hfb3yHqJxuO0VV-9UtI

Практическая №4 (19.09.2022)

# Новый раздел

1) Для печати значений в Питоне есть функция print(). Внутри круглых скобок через запятую мы пишем то, что хотим вывести. Вот программа, которая делает несколько вычислений:
"""

print(5+10)
print(3*7, (17-2)*8)
print(2**16) # две звездочки означают возведение в степень
print(37 / 3) # один слэш - это деление с ответом-дробью
print(37 // 3) # два слэша считают частное от деления нацело
               # это как операция div в других языках
print(37 % 3) # процент означает остаток отделения нацело
              # это как операция mod в других языках

"""2) Попробуем написать программу, которая считывает два числа и выводит их сумму. Для этого считаем два числа и сохраним их в переменные a и b, пользуясь оператором присваивания =. Слева от оператора присваивания в программах на Питоне ставится имя переменной — например, строка из латинских букв. Справа от оператора присваивания ставится любое выражение. Имя станет указывать на результат вычисления выражения. Проиграйте эту программу и посмотрите на результаты её работы:"""

a = input()
b = input()
s = a + b
print(s)

"""3) Каждый объект относится к какому-то типу. Строки хранятся в объектах типа str, целые числа хранятся в объектах типа int, дробные числа (вещественные числа) — в объектах типа float. Тип объекта определяет, какие действия можно делать с объектами этого типа. Например, если в переменных first и second лежат объекты типа int, то их можно перемножить, а если в них лежат объекты типа str, то их перемножить нельзя:"""

first = 5
second = 7
print(first * second)

"""4) Чтобы преобразовать строку из цифр в целое число, воспользуемся функцией int(). Например, int('23') вернет число 23.
Вот пример правильной программы, которая считывает два числа и выводит их сумму:

"""

a = int(input())
b = int(input())
s = a + b
print(s)

"""5) Напишите программу, которая считывает три числа и выводит их сумму. Каждое число записано в отдельной строке.
Во всех задачах считывайте входные данные через input() и выводите ответ через print().

"""

# Эта программа считывает два числа и выводит их сумму:
a = int(input())
b = int(input())
c = int(input())
print(a + b + c)

"""6) Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь. Каждое число записано в отдельной строке."""

a = int(input())
b = int(input())
print(a * b / 2)

"""7) n школьников делят k яблок поровну, неделящийся остаток остается в корзинке. Сколько яблок достанется каждому школьнику? Сколько яблок останется в корзинке? Программа получает на вход числа n и k и должна вывести искомое количество яблок (два числа)."""

# Число n можно считать так:
n = int(input())
# Выводите результат через print()
# Пример на деление, вычитание частного и остатка:
print(63/5)
print(63//5)
print(63 % 5)

"""8) Дано число n. С начала суток прошло n минут. Определите, сколько часов и минут будут показывать электронные часы в этот момент. Программа должна вывести два числа: количество часов (от 0 до 23) и количество минут (от 0 до 59). Учтите, что число n может быть больше, чем количество минут в сутках."""

n = int(input())
hours = n % (60 * 24) // 60
minutes = n % 60
print(hours, minutes)

"""9) Напишите программу, которая приветствует пользователя, выводя слово Hello, введенное имя и знаки препинания по образцу:"""

print('Hello, ' + input() + '!')

"""10) Напишите программу, которая считывает целое число и выводит текст, аналогичный приведенному в примере (пробелы важны!)"""

n =int (input())
print ('The text number for the number '+str(n) +' is '+str(n+1) +'.')
print ('The previous number for the number '+str(n) +' is '+str(n-1) +'.')

"""11) В школе решили набрать три новых математических класса. Так как занятия по математике у них проходят в одно и то же время, было решено выделить кабинет для каждого класса и купить в них новые парты. За каждой партой может сидеть не больше двух учеников. Известно количество учащихся в каждом из трёх классов. Сколько всего нужно закупить парт чтобы их хватило на всех учеников? Программа получает на вход три натуральных числа: количество учащихся в каждом из трех классов."""

a = int (input())
b = int (input())
c = int (input())
print(a // 2 + b // 2 + c // 2 + a % 2 + b % 2 + c % 2)

"""12) Обувная фабрика собирается начать выпуск элитной модели ботинок. Дырочки для шнуровки будут расположены в два ряда, расстояние между рядами равно a, а расстояние между дырочками в ряду b. Количество дырочек в каждом ряду равно N. Шнуровка должна происходить элитным способом “наверх, по горизонтали в другой ряд, наверх, по горизонтали и т.д.” (см. рисунок). Кроме того, чтобы шнурки можно было завязать элитным бантиком, длина свободного конца шнурка должна быть l. Какова должна быть длина шнурка для этих ботинок?"""

a = int (input())
b = int (input())
L = int (input())
N = int (input())
print(2 * L + (2 * N - 1) * a + 2 * (N - 1) * b)